app/controllers/access_keys_controller.rb

  def show
    @access_key = current_user.access_keys.find(params[:id])
---
SELECT * FROM "access_keys" WHERE ("access_keys"."id" = 1 AND ("access_keys".owner_id = 1 AND "access_keys".owner_type = 'User'))

  def destroy
    access_key = current_user.access_keys.find(params[:id])
    access_key.destroy
---
SELECT * FROM "access_keys" WHERE ("access_keys"."id" = 1 AND ("access_keys".owner_id = 1 AND "access_keys".owner_type = 'User'))
DELETE FROM "access_keys" WHERE "id" = 1